[About Language File]
Version=12.6.0
Date=21.09.2016
Author=Lasse Rautiainen
Email=lasse@bonecode.com
Comments=Jos löydät käännösvirheitä, niin kerro minulle. Kiitos.

[MainForm]
ActionDirectoryContextMenu:h=Kontekstivalikko
ActionDirectoryContextMenu=&Kontekstivalikko
ActionDirectoryDelete:h=Poista tiedosto tai hakemisto
ActionDirectoryDelete=&Poista
ActionDirectoryFindInFiles:h=Etsi merkkijonoa tiedostoista
ActionDirectoryFindInFiles=Etsi tiedostoista...
ActionDirectoryProperties:h=Katso tiedoston/hakemiston ominaisuudet
ActionDirectoryProperties=&Ominaisuudet...
ActionDirectoryRefresh:h=Päivitä tiedostot
ActionDirectoryRefresh=&Päivitä
ActionDirectoryRename:h=Nimeä tiedosto tai hakemisto uudelleen
ActionDirectoryRename=&Nimeä uudelleen
ActionDocument=&Dokumentti
ActionDocumentFormat=Muotoile
ActionDocumentFormatSQL:h=Muotoile SQL
ActionDocumentFormatSQL=Muotoile SQL
ActionDocumentFormatXML:h=Muotoile XML
ActionDocumentFormatXML=M&uotoile XML
ActionDocumentFormatJSON:h=Muotoile JSON
ActionDocumentFormatJSON=M&uotoile JSON
ActionDocumentFormatJSONMinify=Pakkaa
ActionDocumentFormatJSONIndent2=Sisennä 2
ActionDocumentFormatJSONIndent3=Sisennä 3
ActionDocumentFormatJSONIndent4=Sisennä 4
ActionDocumentHTMLExport=HTML -vienti
ActionDocumentInfo:h=Rivi-, sana- ja merkkilukumäärä
ActionDocumentInfo=&Tietoja...
ActionDocumentViewInBrowser:h=Katso nykyinen dokumentti oletus selaimessa
ActionDocumentViewInBrowser:s=Alt+B
ActionDocumentViewInBrowser=&Katso selaimessa
ActionEdit=&Muokkaa
ActionEditCopy:h=Kopioi valinta ja aseta se leikepöydälle
ActionEditCopy:s=Ctrl+C
ActionEditCopy=&Kopioi
ActionEditCut:h=Leikkaa valinta ja aseta se leikepöydälle
ActionEditCut:s=Ctrl+X
ActionEditCut=&Leikkaa
ActionEditIndentDecrease:h=Vähennä sisennystä
ActionEditIndentDecrease:s=Shift+Ctrl+U
ActionEditIndentDecrease=&Vähennä
ActionEditDelete=P&oista
ActionEditDeleteEndOfLine:h=Poista rivin loppu
ActionEditDeleteEndOfLine:s=Shift+Ctrl+Y
ActionEditDeleteEndOfLine=R&ivin loppu
ActionEditDeleteLine:h=Poista rivi
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&Rivi
ActionEditDeleteWhitespace:h=Poista kaikki välilyönnit valitusta tekstistä
ActionEditDeleteWhitespace=Välilyönnit
ActionEditDeleteWord:h=Poista sana
ActionEditDeleteWord:s=Ctrl+T
ActionEditDeleteWord=&Sana
ActionEditIndentIncrease:h=Kasvata sisennystä
ActionEditIndentIncrease:s=Shift+Ctrl+I
ActionEditIndentIncrease=Kasvata
ActionEditIndent=&Sisennys
ActionEditInsert=Lisää
ActionEditInsertDateTime:h=Lisää päivämäärä ja aika
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&Päivämäärä ja aika
ActionEditInsertLine:h=Lisää rivi
ActionEditInsertLine:s=Ctrl+Enter
ActionEditInsertLine=&Rivi
ActionEditInsertTag:h=Lisää HTML/XML tagit
ActionEditInsertTag:s=Shift+Ctrl+T
ActionEditInsertTag=&HTML/XML tagit...
ActionEditPaste:h=Lisää leikepöydän sisältö
ActionEditPaste:s=Ctrl+V
ActionEditPaste=&Liimaa
ActionEditRedo:h=Toista viimeksi peruttu toiminto
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=&Toista
ActionEditSelectAll:h=Valitse kaikki
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=&Valitse kaikki
ActionEditSort=&Järjestys
ActionEditSortAsc:h=Lajittele nousevasti
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&Nousevasti
ActionEditSortDesc:h=Lajittele laskevasti
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&Laskevasti
ActionEditToggleCase:h=Vaihda kirjainkokoa
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=Vaihda kirjainkokoa
ActionEditToggleCaseAlternating:h=Vaihda kirjainkokoa
ActionEditToggleCaseAlternating=Vaihto
ActionEditToggleCaseLower:h=Vaihda kirjainkoko pieneksi
ActionEditToggleCaseLower=Pienet
ActionEditToggleCaseSentence:h=Vaihda kirjainkoko lauseeksi
ActionEditToggleCaseSentence=Lause
ActionEditToggleCaseTitle:h=Vaihda kirjainkoko otsikoksi
ActionEditToggleCaseTitle=Otsikko
ActionEditToggleCaseUpper:h=Vaihda kirjainkoko isoksi
ActionEditToggleCaseUpper=Isot
ActionEditUndo:h=Peru viimeisin toiminto
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=&Peru
ActionFile=&Tiedosto
ActionFileClose:h=Sulje aktiivinen dokumentti
ActionFileClose:s=Ctrl+F4
ActionFileClose=&Sulje
ActionFileCloseAll:h=Sulje kaikki avoimet tiedostot
ActionFileCloseAll=S&ulje kaikki
ActionFileCloseAllOther:h=Sulje kaikki muut sivut
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=Sul&je kaikki muut
ActionFileExit:h=Sulj&e sovellus
ActionFileExit:s=Alt+F4
ActionFileExit=L&opeta
ActionFileNew:h=Luo uusi dokumentti
ActionFileNew:s=Ctrl+U
ActionFileNew=&Uusi
ActionFileOpen:h=Avaa dokumentti
ActionFileOpen:s=Ctrl+A
ActionFileOpen=&Avaa...
ActionFilePrint:h=Tul&osta aktiivinen dokumentti
ActionFilePrint:s=Ctrl+P
ActionFilePrint=T&ulosta...
ActionFilePrintPreview:h=Esikatsele aktiivinen dokumentti
ActionFilePrintPreview=E&sikatselu...
ActionFileProperties:h=Katso tiedoston ominaisuudet
ActionFileProperties=&Ominaisuudet...
ActionFileReopen=A&vaa uudelleen
ActionFileReopenClear=&Tyhjennä
ActionFileSave:h=Tallenna aktiivinen dokumentti
ActionFileSave:s=Ctrl+T
ActionFileSave=T&allenna
ActionFileSaveAll:h=Tallenna kaikki dokumentit
ActionFileSaveAll:s=Shift+Ctrl+T
ActionFileSaveAll=Tall&enna kaikki
ActionFileSaveAs:h=Tallenna aktiivinen dokumentti uudella nimellä
ActionFileSaveAs:s=Ctrl+Alt+T
ActionFileSaveAs=Ta&llenna nimellä...
ActionFileSelectFromDirectory:h=Valitse tiedosto aktiivisesta hakemistosta
ActionFileSelectFromDirectory=Valitse hakemistosta
ActionHelp=&Ohje
ActionHelpAboutEditBone:h=Näytä tietoja EditBonesta
ActionHelpAboutEditBone=&Tietoja EditBonesta
ActionHelpCheckForUpdates:h=Tarkasta päivitykset
ActionHelpCheckForUpdates=&Tarkasta päivitykset
ActionHelpVisitHomepage:h=Vieroile EditBonen kotisivuilla - http://www.bonecode.com/
ActionHelpVisitHomepage=&Vieraile kotisivuilla
ActionMacro=Makro
ActionMacroOpen:h=Avaa makro
ActionMacroOpen=&Avaa...
ActionMacroPause:h=Tauota makro
ActionMacroPause:s=Shift+Ctrl+R
ActionMacroPause=&Tauota
ActionMacroPlayback:h=Suorita makro
ActionMacroPlayback:s=Shift+Ctrl+P
ActionMacroPlayback=&Suorita
ActionMacroRecord:h=Nauhoita makro
ActionMacroRecord:s=Shift+Ctrl+R
ActionMacroRecord=&Nauhoita
ActionMacroSaveAs:h=Tallenna makro uudella nimellä
ActionMacroSaveAs=&Tallenna nimellä...
ActionMacroStop:h=Pysäytä makron nauhoitus
ActionMacroStop:s=Shift+Ctrl+S
ActionMacroStop=&Pysäytä
ActionOutputCloseAllOtherPages:h=Sulje kaikki muut
ActionOutputCloseAllOtherPages=Sulje kaikki &muut sivut
ActionOutputClose:h=Sulje aktiivinen sivu
ActionOutputClose=&Sulje
ActionOutputCloseAll:h=Sulje kaikki sivut
ActionOutputCloseAll=Sulje &kaikki
ActionOutputCopyAllToClipboard=&Kopioi kaikki leikepöydälle
ActionOutputCopyAllToClipboard:h=Kopioi kaikki leikepöydälle
ActionOutputCopySelectedToClipboard=Kopioi valitut leikepöydälle
ActionOutputCopySelectedToClipboard:h=Kopioi valitut leikepöydälle
ActionOutputOpenAll=&Avaa kaikki
ActionOutputOpenAll:h=Avaa kaikki tiedostot
ActionOutputOpenSelected=&Avaa valitut
ActionOutputOpenSelected:h=Avaa valitut tiedostot
ActionOutputSelectAll=Valitse kaikki
ActionOutputSelectAll:h=Valitse kaikki tiedostot
ActionOutputUnselectAll=Poista kaikki valinnat
ActionOutputUnselectAll:h=Poista kaikki valinnat tiedostoista
ActionSearch=&Etsi
ActionSearchClearBookmarks:h=Poista kaikki kirjanmerkit
ActionSearchClearBookmarks=Poista &kirjanmerkit
ActionSearchClose:h=Sulje
ActionSearchFindInFiles:h=Etsi merkkijonoa tiedostoista
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=Etsi tiedostoista...
ActionSearchFindNext:h=Etsi seuraava samanlainen teksti
ActionSearchFindNext:s=F3
ActionSearchFindNext=Etsi seuraava
ActionSearchFindPrevious:h=Etsi edellinen samanlainen teksti
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=Etsi edellinen
ActionSearchGoToBookmarks:h=Mene kirjanmerkkeihin
ActionSearchGoToBookmarks=Mene kirjanmerkkeihin
ActionSearchGoToLine:h=Mene riville
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=Mene riville
ActionSearchOptions:h=Hakuasetukset
ActionSearchReplace:h=Korvaa määritetty teksti eri tekstillä
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&Korvaa...
ActionSearchSearchButton:h=Etsi määritetty teksti
ActionSearchSearch:s=Ctrl+F
ActionSearchSearchButton=&Etsi...
ActionSearchToggleBookmark:h=Aseta tai poista kirjanmerkki nykyiselle riville. Kirjanmerkit voidaan myös asettaa käyttämällä Ctrl+Shift+1..9. Siirry kirjanmerkkiin Ctrl+1..9 avulla.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=Vaihda kirjanmerkki
ActionSearchToggleBookmarks:h=Vaihda kirjanmerkkejä
ActionSearchToggleBookmarks=Vaihda kirjanmerkkejä
ActionSearchEngine:h=Valitse etsintämoottori
ActionSearchCaseSensitive:h=Merkkikokoriippuvainen
ActionSearchInSelection:h=Valinnasta
ActionToolbarMenuLanguage=Kieli
ActionToolbarMenuSkin=Tyyli...
ActionToolbarMenuView=Näkymä
ActionTools=T&yökalut
ActionToolsCharacterMap:h=Aseta Unicode -merkki aktiiviseen dokumenttiin tuplaklikkaamalla
ActionToolsCharacterMap=&Unicode merkistö...
ActionToolsCompareFiles:h=Vertaa tiedostoja
ActionToolsCompareFiles=&Vertaa tiedostoja...
ActionToolsConvert:h=Muunna numeraalisten yksiköiden välillä
ActionToolsConvert=&Muunna...
ActionToolsLanguageEditor:h=Kielieditori
ActionToolsLanguageEditor=&Kielieditori...
ActionToolsOptions:h=Asetukset
ActionToolsOptions=&Asetukset...
ActionToolsSelectForCompare:h=Valitse dokumentti vertailuun
ActionToolsSelectForCompare=Valitse vertailuun...
ActionView=&Näytä
ActionViewCloseDirectory:h=Sulje aktiivinen hakemisto
ActionViewCloseDirectory:s=Shift+Ctrl+D
ActionViewCloseDirectory=&Sulje hakemisto
ActionViewColorSelection:h=Näytä tai piilota värin valinta
ActionViewColorSelection=Väri
ActionViewDirectory:h=Näytä tai piilota hakemisto
ActionViewDirectory=&Hakemisto
ActionViewEditDirectory:h=Muokkaa aktiivista hakemistoa
ActionViewEditDirectory:s=Shift+Ctrl+E
ActionViewEditDirectory=&Muokkaa hakemistoa...
ActionViewEncodingSelection:h=Näytä tai piilota koodauksen valinta
ActionViewEncodingSelection=K&oodaus
ActionViewFiles:h=Etsi tiedostoja valitusta hakemistopolusta ja sen alihakemistoista
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&Tiedostot...
ActionViewFold=Taita
ActionViewFoldAll=Taita kaikki
ActionViewFoldAll:h=Taita kaikki
ActionViewFoldAllDownFromSelectedLine=Taita kaikki alaspäin valitulta riviltä 
ActionViewFoldAllDownFromSelectedLine:h=Taita kaikki alaspäin valitulta riviltä 
ActionViewFoldAllUpFromSelectedLine=Taita kaikki ylöspäin valitulta riviltä 
ActionViewFoldAllUpFromSelectedLine:h=Taita kaikki ylöspäin valitulta riviltä 
ActionViewFoldSelected=Taita valitut
ActionViewFoldSelected:h=Taita valitut
ActionViewUnfold=Avaa
ActionViewUnfoldAll=Avaa kaikki
ActionViewUnfoldAll:h=Avaa kaikki
ActionViewUnfoldAllDownFromSelectedLine=Avaa kaikki alaspäin valitulta riviltä 
ActionViewUnfoldAllDownFromSelectedLine:h=Avaa kaikki alaspäin valitulta riviltä 
ActionViewUnfoldAllUpFromSelectedLine=Avaa kaikki ylöspäin valitulta riviltä 
ActionViewUnfoldAllUpFromSelectedLine:h=Avaa kaikki ylöspäin valitulta riviltä 
ActionViewUnfoldSelected=Avaa valitut
ActionViewUnfoldSelected:h=Avaa valitut
ActionViewHighlighterSelection:h=Näytä tai piilota korostuksen valinta
ActionViewHighlighterSelection=&Korostus
ActionViewLineNumbers:h=Vaihda rivinumerointi
ActionViewLineNumbers=Rivinumerointi
ActionViewMainMenu:h=Näytä tai piilota päävalikko
ActionViewMainMenu=Päävalikko
ActionViewMenuBar:h=Näytä tai piilota valikkorivi
ActionViewMenuBar=Valikkorivi
ActionViewMiniMap:h=Näytä tai piilota minikartta
ActionViewMiniMap=Minikartta
ActionViewNextPage:h=Mene seuraavalle sivulle
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=Seuraava sivu
ActionViewOpenDirectory:h=Avaa uusi hakemisto
ActionViewOpenDirectory:s=Ctrl+D
ActionViewOpenDirectory=&Avaa hakemisto...
ActionViewOutput:h=Näytä tai piilota tuloste
ActionViewOutput=&Tuloste
ActionViewPreviousPage:h=Mene edelliselle sivulle
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=Edellinen sivu
ActionViewSelectionMode:h=Vaihda valintatila. Myös Altin painaminen editorissa vaihtaa valintatilan.
ActionViewSelectionMode=&Valintatila
ActionViewSpecialChars:h=Vaihda erikoismerkit
ActionViewSpecialChars=&Erikoismerkit
ActionViewSplit:h=Jaa dokumentti
ActionViewSplit=&Jako
ActionViewSyncEdit=Synkronoitu muokkaus
ActionViewSyncEdit:h=Näyä tai piilota synkronoitu muokkaus
ActionViewSyncEdit:s=Shift+Ctrl+J
ActionViewStatusBar:h=Näytä tai piilota tilarivi
ActionViewStatusBar=T&ilarivi
ActionViewToolbar:h=Näytä tai piilota työkalupalkki
ActionViewToolbar=Työkalupalkki
ActionViewTitleBar=Otsikkopalkki
ActionViewTitleBarFilename=Tiedostonimi
ActionViewTitleBarFilename:h=Näytä tai piilota otsikkopalkin tiedostonimi
ActionViewTitleBarFileList=Tiedostolista
ActionViewTitleBarFileList:h=Näytä tai piilota otsikkopalkin tiedostolista
ActionViewWordWrap:h=Vaihda rivitys
ActionViewWordWrap=&Rivitys
ActionViewXMLTree:h=Näytä tai piilota XML puu
ActionViewXMLTree=&XML puu
ActionXMLTreeRefresh:h=Päivitä XML puu
ActionXMLTreeRefresh=&Päivitä
PanelDocument=Prosessoi...

[AskYesOrNo]
ChangeColorFile=Olet muuttamassa alkuperäistä väritiedostoa. Luo uusi muokattu väritiedosto?
CancelSearch=Peruuta haku, oletko varma?
CloseDirectory=Sulje hakemisto %s, oletko varma?
DeleteDirectory=Poista hakemisto %s, oletko varma?
DeleteFile=Poista tiedosto %s, oletko varma?
DeleteLine=Poista rivi, oletko varma?
DocumentTimeChanged=Dokumentin %s aika/päivämäärä muuttunut. Ladataanko uudelleen?
NewVersion=Uusi versio %s %ssta on saatavilla.  %sHaluatko ladata sen Internetistä?
RecordMacro=Nauhoita uusi makro, oletko varma?
ReplaceOccurence=Korvaa tämä '%s' esiintymä?
SaveChanges=Tallenna muutokset?
SearchMatchNotFound=Etsittyä merkkijonoa ei löydy.%sKäynnistetäänkö etsintä tiedoston alusta uudelleen?
SearchStringNotFound=Etsittyä merkkijonoa '%s' ei löydy

[Message]
CannotFindString=Merkkijonoa '%s' ei löydy
DocumentStatistics=Rivilukumäärä: %d%sSanalukumäärä: %d%sMerkkilukumäärä: %d
LatestVersion=Käytät viimeisintä versiota.
SelectFilePathFromDirectory=Valitse tiedostopolku hakemistosta
NoDefaultPrinter=Oletuskirjoitinta ei ole valittu. 

[ErrorMessage]
EnterPath=Anna polku.
EnterTabName=Anna välilehdelle nimi.
FileNotFound=Tiedostoa '%s' ei löydy.
PathNotExist=Polkua ei löydy.
RootDirectoryNotExist=Juurihakemistoa ei ole olemassa.

[WarningMessage]
FileAccessError=Tiedoston %s lukuvirhe.

[Constant]
AllFiles=Kaikki tiedostot
AllSkinsDownload=Lataa kaikki tyylit
Arrow=Nuoli
AutoSave=Autom. tallennus
Block=Lohko
Bookmark=Kirjanmerkki
Bottom=Alareuna
Circle=Ympyrä
Color=Väri
CompareFiles=Vertaa tiedostoja
CountingFiles=Lasketaan tiedostoja...
DirectoryItems=Tiedostot
Document=Dokumentti
Dot=Piste
DownloadCancelling=Peruutetaan...
DownloadDone=Suoritettu.
EditDirectory=Muokkaa hakemistoa
Encoding=Koodaus
Enter=Rivinvaihto
FileMaskItems=Tiedostosuodattimet
FilesFound=%d tiedosto(a) löydettiin ajassa %s
FooterLeft=Alatunniste - vasen
FooterRight=Alatunniste - oikea
GoToLine=Mene riville
HalfBlock=Puolilohko
HeaderLeft=Ylätunniste - vasen
HeaderRight=Ylätunniste - oikea
Hide=Piilota
Highlighter=Korostus
HorizontalLine=Vaakaviiva
Insert=Lisäys
InsertTags=Lisää HTML/XML tagi
InvalidName=Virheellinen nimi
LanguageEditor=Kielieditori - [%s]
Line=Rivi
MatchFound=%d osuma%s löytyi
MatchFoundPluralExtension=a
Minute=min
Modified=Muokattu
Normal=Normaali
OccurencesFound=%d esiintymää löydetty %s
Open=Avaa
OpenDirectory=Avaa hakemisto
Overwrite=Korvaus
Pilcrow=Kappaleen merkki
Position=Paikka: %d
PreviewDocumentPage=Sivu: $PAGENUM$/$PAGECOUNT$
PreviewPage= Sivu: %d / %d
PreviewPrintDocument=Tulosta (%s)|Tulosta dokumentti %s
PrintedBy=Tulostettu %slla
RegularExpression=Säännöllinen lauseke
Rename=Haluatko uudelleen nimetä %s:n %s:ksi?
RenameFailed=%s uudelleen nimeäminen epäonnistui
SaveAs=Tallenna nimellä
SearchFor=Etsi '%s'
SearchItems=Hakusanat
Second=s
SelectRootDirectory=Valitse juurihakemisto
Solid=Umpinainen
Square=Neliö
TextToFindItems=Etsi kohteet
ThinHorizontalLine=Ohut vaakaviiva
ThinVerticalLine=Ohut pystyviiva
Top=Yläreuna
TopLine=Ylin rivi: %d
Triangle=Kolmio
VersionInfoNotFound=Versiotietoja ei löydy.
VerticalLine=Pystyviiva
Wildcard=Villikortti

[DialogConstant]
SMsgDlgAbort=&Peru
SMsgDlgAll=&Kaikki
SMsgDlgCancel=Peruuta
SMsgDlgClose=&Sulje
SMsgDlgConfirm=Varmista
SMsgDlgError=Virhe
SMsgDlgHelp=&Ohje
SMsgDlgHelpHelp=Ohje
SMsgDlgHelpNone=Ei ohjetta saatavana
SMsgDlgIgnore=&Sivuuta
SMsgDlgInformation=Tiedotus
SMsgDlgNo=&Ei
SMsgDlgNoToAll=E&i kaikkiin
SMsgDlgOK=OK
SMsgDlgRetry=&Yritä uudelleen
SMsgDlgWarning=Varoitus
SMsgDlgYes=&Kyllä
SMsgDlgYesToAll=K&yllä kaikkiin

[ColorConstant]
SNameBlack=Musta
SNameMaroon=Kastanjanruskea
SNameGreen=Vihreä
SNameOlive=Oliivi
SNameNavy=Laivastonsininen
SNamePurple=Violetti
SNameTeal=Tavi
SNameGray=Harmaa
SNameSilver=Hopea
SNameRed=Punainen
SNameLime=Lime
SNameYellow=Keltainen
SNameBlue=Sininen
SNameFuchsia=Fuksia
SNameAqua=Vesi
SNameWhite=Valkoinen
SNameMoneyGreen=Rahanvihreä
SNameSkyBlue=Taivaansininen
SNameCream=Kerma
SNameMedGray=Keskiharmaa
SNameActiveBorder=Aktiivinen reuna
SNameActiveCaption=Aktiivinen otsikko
SNameAppWorkSpace=Sovelluksen työtila
SNameBackground=Taustaväri
SNameBtnFace=Painike
SNameBtnHighlight=Painikekorostus
SNameBtnShadow=Painikevarjo
SNameBtnText=Painiketeksti
SNameCaptionText=Otsikkoteksti
SNameDefault=Oletus
SNameGradientActiveCaption=Aktiivinen otsikko liuku
SNameGradientInactiveCaption=Toimeton otsikko liuku
SNameGrayText=Harmaa teksti
SNameHighlight=Taustakorostus
SNameHighlightText=Tekstin korostus
SNameHotLight=Kuuma valo
SNameInactiveBorder=Toimeton reuna
SNameInactiveCaption=Toimeton otsikko
SNameInactiveCaptionText=Toimeton otsikkoteksti
SNameInfoBk=Tiedoksitausta
SNameInfoText=Tiedoksiteksti
SNameMenu=Valikon tausta
SNameMenuBar=Valikkorivi
SNameMenuHighlight=Valikkokorostus
SNameMenuText=Valikkoteksti
SNameNone=Ei mitään
SNameScrollBar=Vierityspalkki
SName3DDkShadow=3D tumma varjo
SName3DLight=3D valo
SNameWindow=Ikkunatausta
SNameWindowFrame=Ikkunakehys
SNameWindowText=Ikkunateksti
SColorBoxCustomCaption=Muokattu...

[FileTypes]
ActionScript=ActionScript -tiedostot (*.as)
ASP=ASP -tiedostot (*.asp)
Assembler 68HC11=68HC11 Assembler -tiedostot (*.hc11;*.asc)
AutoIt v3=AutoIt -tiedostot (*.au3)
AWK=AWK -skriptit (*.awk)
C#=C# -tiedostot (*.cs)
C++=C++ -tiedostot (*.cpp;*.hpp)
C=C -tiedostot (*.c;*.h)
CoffeeScript=CoffeeScript -tiedostot (*.coffee)
CSS=Cascading Stylesheet -tiedostot (*.css)
D=D -tiedostot (*.d;*.di)
Delphi Form Module=Delphi Form Module -tiedostot (*.dfm)
Free Pascal=Free Pascal -tiedostot (*.pp)
GLSL=GLSL -tiedostot (*.glsl)
Go=Go -tiedostot (*.go)
Groovy=Groovy -tiedostot (*.groovy;*.gvy;*.gy;*.gsh)
HTML with Scripts=HTML -tiedostot (*.html;*.htm)
INI=INI -tiedostot (*.ini;*.lng)
Inno Setup=Inno Setup -tiedostot (*.iss)
Java=Java -tiedostot (*.java)
JavaScript=JavaScript -tiedostot (*.js)
JSON=JSON -tiedostot (*.json)
LaTex=LaTex -tiedostot (*.lat;*.tex;*.lex)
Lisp=Lisp -tiedostot (*.lisp)
Lua=Lua -tiedostot (*.lua)
MATLAB=MATLAB -tiedostot (*.matlab)
MS-DOS Batch=MS-DOS Batch -tiedostot (*.bat;*.cmd)
Objective-C=Objective-C -tiedostot (*.m)
Object Pascal=Pascal -tiedostot (*.pas;*.dpr;*.dpk)
OCaml=OCaml -tiedostot (*.ml)
Perl=Perl -tiedostot (*.pl;*.pm;*.cgi)
PHP=PHP -tiedostot (*.php;*.class;*.inc)
PowerShell=PowerShell -tiedostot (*.ps1)
Python=Python -tiedostot (*.py)
Ruby=Ruby -tiedostot (*.rb;*.rbw)
Rust=Rust -tiedostot (*.rc)
Scala=Scala -tiedostot (*.scala)
SQL - Standard=SQL -tiedostot (*.sql)
TclTk=Tcl/Tk -tiedostot (*.tcl)
Text=Tekstitiedostot (*.txt)
TypeScript=TypeScript -tiedostot (*.ts)
UnrealScript=UnrealScript -tiedostot (*.uc)
Visual Basic=Visual Basic -tiedostot (*.vb;*.bas)
XML=XML -tiedostot (*.xml;*.xsd;*.dtd;*.dproj;*.groupproj)
XSL=XSL -tiedostot (*.xsl;*.xslt)
Macro=Macro -tiedostot (*.mcr)|*.mcr
Language=Kielitiedostot (*.lng)|*.lng

[ConfirmReplaceDialog]
ButtonCancel=&Peruuta
Caption=Vahvista korvaus
ButtonNo=&Ei
ButtonYes=&Kyllä
ButtonYesToAll=Kyllä k&aikkiin

[DownloadURLDialog]
ButtonCancel=Peruuta
Caption=Lataa

[FindInFilesDialog]
ButtonCancel=Peruuta
Caption=Etsi tiedostoista
StickyLabelCaseSensitive=Merkkikokoriippuvaisuus
ComboBoxFileMask=Tiedostosuodatin
ButtonFind=&Etsi
ComboBoxTextToFind=Etsi
ComboBoxDirectory=Hakemisto
StickyLabelIncludeSubdirectories=Sisällytä alihakemistot
GroupBoxOptions=Valinnat
GroupBoxSearchDirectoryOptions=Hakemisto valinnat

[InputQueryDialog]
ButtonOK=OK
ButtonCancel=Peruuta

[ItemListDialog]
ActionInsert=Lisää
ActionInsert:h=Lisää kohde
ActionDelete=Poista
ActionDelete:h=Poista kohde
ActionClearAll=Tyhjennä kaikki
ActionClearAll:h=Tyhjennä kaikki kohteet
ActionMoveUp=Siirrä ylös
ActionMoveUp:h=Siirrä valittu kohde ylös
ActionMoveDown=Siirrä alas
ActionMoveDown:h=Siirrä valittu kohde alas
ActionSort=Järjestä
ActionSort:h=Järjestä kohteet

[SearchOptionsDialog]
StickyLabelBeepIfSearchStringNotFound=Piippaa, jos etsittyä merkkijonoa ei löydy
StickyLabelCaseSensitive=Merkkikokoriippuvaisuus
StickyLabelEntireScope=Koko laajuus
StickyLabelHighlightResult=Korosta tulokset
StickyLabelRegularExpression=Säännöllinen lauseke
StickyLabelSearchOnTyping=Etsi kirjoitettaessa
StickyLabelSelectedOnly=Vain valinnasta
StickyLabelShowSearchMatchNotFound=Näytä "Etsittyä merkkijonoa ei löydy." -viesti
StickyLabelShowSearchStringNotFound=Näytä "Etsittyä merkkijonoa ei löydy. Käynnistetäänkö etsintä tiedoston alusta uudelleen?" -viesti
StickyLabelWildCard=Jokerimerkki
StickyLabelWholeWordsOnly=Vain kokonaiset sanat
StickyLabelWrapAround=Aloita alusta, jos ei löydy
ButtonOK=OK
ButtonCancel=Peruuta

[OptionsToolbarItemsDialog]
Caption=Valitse kohtia
VirtualDrawTreeAddItems:0=Valikon kohta
ButtonAdd=Lisää
ButtonCancel=Peruuta

[ReplaceDialog]
ButtonCancel=Peruuta
ButtonFind=&Etsi
ButtonReplaceAll=&Korvaa kaikki
Caption=Korvaa
ComboBoxSearchFor=Etsi
GroupBoxOptions=Valinnat
GroupBoxReplaceIn=Korvaa
RadioButtonAllOpenFiles=Kaikki avoimet tiedostot
RadioButtonDeleteLine=Poista rivi
RadioButtonReplaceWith=Korvaa
RadioButtonWholeFile=Koko tiedosto
StickyLabelCaseSensitive=Merkkikokoriippuvuus
StickyLabelPromptOnReplace=Kehoite vaihdettaessa
StickyLabelRegularExpression=Säännöllinen lauseke
StickyLabelSelectedOnly=Vain valinnasta
StickyLabelWholeWordsOnly=Vain kokonaiset sanat
StickyLabelWildCard=Jokerimerkki

[SkinSelectDialog]
PanelPreviewArea=Esikatselu
GroupBoxSkinColorization=Tyylin väritys
LabelHueOffset=Värisävy
LabelSaturation=Kylläisyys
LabelBrightness=Kirkkaus
StickyLabelExtendedBordersMode=Laajennettu reunojen tila
StickyLabelBlendOnMove=Sulauta näyttö siirrettäessä
StickyLabelAllowGlowing=Salli hehku

[ConvertForm]
Caption=Muunna numeraalisten yksiköinen välillä
ComboBoxType=Tyyppi
ComboBoxFrom=Mistä
ComboBoxTo=Miksi
EditValue=Arvo
EditResult=Tulos

[PrintPreviewDialog]
ActionColors=Värit
ActionColors:h=Vaihda värit
ActionExit=Sulje
ActionExit:h=Sulje esikatselu
ActionFirst=Ensimmäinen
ActionFirst:h=Ensimmäinen|Mene ensimmäiselle sivulle
ActionHighlight=Korostus
ActionHighlight:h=Vaihda korostus
ActionLast=Viimeinen
ActionLast:h=Viimeinen|Mene viimeiselle sivulle
ActionLineNumbers=Rivinumerot
ActionLineNumbers:h=Vaihda rivinumerot
ActionNext=Seuraava
ActionNext:h=Seuraava|Mene seuraavalle sivulle
ActionPrevious=Edellinen
ActionPrevious:h=Edellinen|Mene edelliselle sivulle
ActionPrint=Tulosta
ActionPrint:h=Tulosta|Tulosta dokumentti
ActionWordWrap=Rivitys
ActionWordWrap:h=Vaihda rivitys
ActionZoomIn=Zoomaa sisään
ActionZoomIn:h=Zoomaa sisään
ActionZoomOut=Zoomaa ulos
ActionZoomOut:h=Zoomaa ulos
ActionZoom=Zoomaus
ActionZoom:h=Zoomaus|Zoomaa sisään/ulos
Caption=Esikatselu

[SearchForFilesForm]
Caption=Etsi tiedostoja
PanelSearchingFiles=Etsitään tiedostoja...

[CompareFrame]
CopySelectionLeftAction:h=Kopioi valinta vasemmalle
CopySelectionRightAction:h=Kopioi valinta oikealle
FindNextDifferenceAction:h=Etsi seuraava eroavaisuus
LeftDocumentButtonClickAction:h=Avaa dokumentti
LeftLabel=Vasen rivi
OpenDocumentsLeftAction:h=Avaa dokumentti
OpenDocumentsRightAction:h=Avaa dokumentti
RefreshAction:h=Päivitä dokumentit
RightDocumentButtonClickAction:h=Avaa dokumentti
RightLabel=Oikea rivi
SaveLeftGridAction:h=Tallenna dokumentti
SaveRightGridAction:h=Tallenna dokumentti

[OptionsCompareFrame]
StickyLabelIgnoreCase=Ei välitetä merkin koosta
StickyLabelIgnoreBlanks=Ei välitetä tyhjistä merkeistä

[OptionsEditorCaretFrame]
StickyLabelVisible=Näytä
StickyLabelRightMouseClickMovesCaret=Oikean hiiren painikkeen painallus liikuttaa kohdistinta
GroupBoxNonBlinkingCaret=Vilkkumaton kohdistin
StickyLabelNonblinkingCaretEnabled=Käytössä
ColorBoxNonblinkingCaretBackground=Taustaväri
ColorBoxNonblinkingCaretForeground=Piirtoväri
GroupBoxStyles=Tyylit
ComboBoxStylesInsertCaret=Lisäys
ComboBoxStylesOverwriteCaret=Ylikirjoitus

[OptionsEditorCodeFoldingFrame]
StickyLabelVisible=Näytä
StickyLabelFoldMultilineComments=Taita moniriviset kommentit
StickyLabelHighlightIndentGuides=Korosta sisennysohjaimet
StickyLabelHighlightMatchingPair=Korosta vastinparit
StickyLabelShowCollapsedCodeHint=Näytä luhistettu koodi vihjeenä
StickyLabelShowCollapsedLine=Näytä luhistettu viiva
StickyLabelShowIndentGuides=Näytä sisennysohjaimet
StickyLabelShowTreeLine=Näytä puun viiva
StickyLabelUncollapseByHintClick=Avaa luhistettu taitos vihjettä klikkaamalla
ComboBoxMarkStyle=Merkin tyyli
EditHintRowCount=Vihje rivien lukumäärä

[OptionsEditorColorFrame]
ComboBoxColor=Väri
ComboBoxHighlighter=Korostus
TabSheetEditor=Editori
ComboBoxEditorElement=Elementti
ColorComboBoxEditorColor=Väri
TabSheetElements=Elementit
ComboBoxElementsName=Nimi
ColorComboBoxElementsForeground=Piirtoväri
ColorComboBoxElementsBackground=Taustaväri
GroupBoxAttributes=Ominaisuudet
StickyLabelElementsAttributesBold=Lihavoitu
StickyLabelElementsAttributesItalic=Kursiivi
StickyLabelElementsAttributesUnderline=Alleviivattu
TabSheetGeneral=Yleinen
EditVersion=Versio
DateEditDate=Päivämäärä
TabSheetAuthor=Tekijä
EditName=Nimi
EditEmail=Sähköposti
TabSheetUseSkinColor=Käytä tyylin väriä
LabelSkinDescription=Käytä tyylin väriä valituille elementeille
StickyLabelSkinActiveLineBackground=Aktiivisen rivin taustaväri
StickyLabelSkinForeground=Piirtoväri
StickyLabelSkinSelectionForeground=Valinnan piirtoväri
StickyLabelSkinLeftMarginBackground=Vasemman marginaalin taustaväri
StickyLabelSkinCodeFoldingBackground=Koodin taiton taustaväri
StickyLabelSkinCompletionProposalBackground=Täydennysehdotuksen taustaväri
StickyLabelSkinBackground=Taustaväri
StickyLabelSkinSelectionBackground=Valinnan taustaväri
StickyLabelSkinBookmarkPanelBackground=Kirjanmerkkipaneelin taustaväri
StickyLabelSkinCodeFoldingHintBackground=Koodin taittovinkin taustaväri
StickyLabelSkinCompletionProposalSelectionBackground=Täydennysehdotuksen valinnan taustaväri

[OptionsEditorCompletionProposalFrame]
StickyLabelEnabled=Käytössä
StickyLabelCaseSensitive=Merkkikokoriippuvaisuus
StickyLabelAutoInvoke=Automaattisesti esiin
ComboBoxShortcut=Pikavalinta

[OptionsEditorFontFrame]
ComboBoxColor=Väri
ComboBoxElement=Elementti
FontComboBoxFont=Kirjasin
EditFontSize=Kirjasimen koko

[OptionsEditorLeftMarginFrame]
StickyLabelAutoSize=Automaattinen koko
StickyLabelShowAfterLastLine=Rivinumerointi viimeisen rivin jälkeen
StickyLabelShowBookmarkPanel=Näytä kirjanmerkkipaneli
StickyLabelShowBookmarks=Näytä kirjanmerkit
StickyLabelShowInTens=Numerointi kymmenen välein
StickyLabelShowLeadingZeros=Rivinumerointin nollasta alkaen
StickyLabelShowLineState=Näytä rivin tila
StickyLabelVisible=Näytä
EditLineNumbersStartFrom=Alkaen
EditBookmarkPanelWidth=Kirjanmerkkipaneelin leveys
EditWidth=Leveys
GroupBoxLineNumbers=Rivinumerot

[OptionsEditorMatchingPairFrame]
StickyLabelEnabled=Käytössä
StickyLabelHighlightAfterToken=Korosta viimeisen kirjaimen jälkeen
StickyLabelHighlightUnmatched=Korosta parittomat

[OptionsEditorMinimapFrame]
StickyLabelVisible=Näytä
StickyLabelShowBookmarks=Näytä kirjanmerkit
StickyLabelShowBorder=Näytä reuna
StickyLabelShowIndentGuides=Näytä sisennysapuviivat
StickyLabelShowSearchResults=Näytä hakutulokset
StickyLabelShowShadow=Näytä varjo
StickyLabelUseBlending=Käytä sekoitusta
StickyLabelInvertBlending=Käänteinen sekoitus
ComboBoxAlign=Sijainti
EditWidth=Leveys

[OptionsEditorOptionsFrame]
StickyLabelAutoIndent=Automaattinen sisennys
StickyLabelAutoSave=Automaattinen tallennus
StickyLabelDragDropEditing=Raaha ja pudota muokkaus
StickyLabelDropFiles=Pudota tiedostot
StickyLabelGroupUndo=Ryhmä peruutus
StickyLabelTrimTrailingSpaces=Trimmaa lopussa olevat välilyönnit
StickyLabelUndoAfterSave=Peruutus tallennuksen jälkeen
EditLineSpacing=Riviväli

[OptionsEditorRightMarginFrame]
StickyLabelVisible=Näytä
StickyLabelAutoLineBreak=Automaattinen rivinvaihto
StickyLabelMouseMove=Liikuta hiirellä
StickyLabelShowMovingHint=Näytä liikkuva vihje
EditPosition=Sijainti

[OptionsEditorScrollFrame]
StickyLabelAutosizeMaxWidth=Automaattinen maksimi pituus
StickyLabelHalfPage=Puoli sivua
StickyLabelHintFollows=Vihje seuraa
StickyLabelPastEndOfFile=Vieritä tiedoston lopun yli
StickyLabelPastEndOfLineMarker=Vieritä rivin lopun yli
StickyLabelShowHint=Näytä vierityspalkin vihje
StickyLabelShowShadow=Näytä varjo

[OptionsEditorSearchFrame]
StickyLabelDocumentSpecificSearch=Dokumenttikohtainen haku
StickyLabelShowSearchMap=Näytä hakukartta
StickyLabelHighlightResults=Näytä haun korostus
ComboBoxAlign=Sijainti

[OptionsEditorSelectionFrame]
StickyLabelVisible=Näytä
StickyLabelALTSetsColumnMode=ALT asettaa saraketilan
StickyLabelExpandRealNumbers=Laajenna liukuluvut
StickyLabelHighlightSimilarTerms=Korosta valinnan mukaan
StickyLabelTermsCaseSensitive=Korostetulla valinnalla merkkikokoriippuvaisuus
StickyLabelFromEndOfLine=Rivin lopusta
StickyLabelToEndOfLine=Rivin loppuun
StickyLabelToEndOfLastLine=Viimeisen rivin loppuun
StickyLabelTripleClickRowSelect=Rivin valinta kolmoispainalluksella

[OptionsEditorSpecialCharsFrame]
StickyLabelUseTextColor=Käytä tekstin väriä
StickyLabelUseMiddleColor=Käytä keskiväriä
ColorComboBoxColor=Väri
ComboBoxStyle=Tyyli                      
GroupBoxEndOfLine=Rivin loppu
StickyLabelEndOfLineVisible=Näytä
GroupBoxEndOfLine=Väri
ComboBoxEndOfLineStyle=Tyyli
GroupBoxSelection=Valinta
StickyLabelSelectionVisible=Näytä
ColorComboBoxSelectionColor=Väri

[OptionsEditorSyncEditFrame]
StickyLabelEnabled=Käytössä
StickyLabelCaseSensitive=Merkkikokoriippuvaisuus
StickyLabelShowActivateIcon=Näytä aktivointi-ikoni

[OptionsEditorTabulatorFrame]
StickyLabelSelectedBlockIndent=Valitun tekstin sisennys
StickyLabelTabsToSpaces=Sarkaimet välilyönneiksi
StickyLabelColumns=Sarakkeet
StickyLabelPreviousLineIndent=Edellisen rivin sisennys
EditWidth=Pituus

[OptionsMainMenuFrame]
StickyLabelUseSystemFont=Käytä järjestelmän kirjasinta
FontComboBoxFont=Kirjasin
EditFontSize=Kirjasimen koko

[OptionsOutputFrame]
StickyLabelShowTreeLines=Näytä puun viivat
StickyLabelShowCheckBox=Näytä valintalaatikko
EditIndent=Sisennys

[OptionsPrintFrame]
ComboBoxDocumentName=Dokumentin nimi
ComboBoxPageNumber=Sivunumerointi
ComboBoxPrintedBy=Tulostettu
ComboBoxDateTime=Päiväys
StickyLabelShowHeaderLine=Näytä ylätunnisteen viiva
StickyLabelShowFooterLine=Näytä alatunnisteen viiva
StickyLabelShowLineNumbers=Näytä rivinumerointi
StickyLabelWordWrap=Rivitys

[OptionsSQLAlignmentsFrame]
ComboBoxKeywordAlign=Avainsanan kohdistus
StickyLabelKeywordAlignmentLeftJustify=Avainsana tasaus tiukasti vasemmalle

[OptionsSQLCapitalizationFrame]
ComboBoxKeywords=Avainsanat
ComboBoxIdentifier=Tunniste
ComboBoxQuotedIdentifier=Tunniste lainausmerkeissä
ComboBoxTableName=Taulun nimi
ComboBoxColumnName=Sarakkeen nimi
ComboBoxAliasName=Aliasnimi
ComboBoxVariableName=Muuttujan nimi
ComboBoxFunctionName=Funktion nimi
ComboBoxDataType=Tietotyyppi

[OptionsSQLFormatterFrame]
ComboBoxDatabase=Tietokanta

[OptionsSQLIndentationFrame]
EditIndentLength=Sisennyksen pituus
StickyLabelUseTab=Käytä tabulaattoria
EditTabSize=Tabulaattorin koko
EditFunctionBodyIndent=Funktion rungon sisennys
StickyLabelBlockOnNewLine=Kooste uudella rivillä
EditBlockLeftIndentSize=Koosteen vasemman sisennyksen koko
EditBlockRightIndentSize=Koosteen oikean sisennyksen koko
EditBlockIndentSize=Koosteen sisennyksen koko
EditSingleStatementIndent=IF/ELSE yksittäisen lauseen sisennyksen koko

[OptionsSQLInsertFrame]
ComboBoxColumnListStyle=Sarakelistan tyyli
ComboBoxValueListStyle=Arvolistan tyyli
EditInsertColumnsPerLine=Sarakkeita per rivi
StickyLabelParenthesisInSeparateLines=Kaarisulut erillisillä riveillä

[OptionsSQLSelectFrame]
TabSheetColumnList=Sarakelista
TabSheetSubquery=Alikysely
TabSheetIntoClause=INTO -lauseke
TabSheetFromJoinClause=FROM/JOIN -lauseke
TabSheetAndOrKeyword=AND/OR -avainsana
TabSheetGroupByClause=GROUP BY -lauseke
TabSheetHavingClause=HAVING -lauseke
TabSheetOrderByClause=ORDER BY -lauseke
ComboBoxColumnListStyle=Tyyli
ComboBoxColumnListLineBreak=Rivinvaihto
StickyLabelAlignAlias=Kohdistusalias
StickyLabelColumnInNewLine=Sarakeita uudella rivillä
StickyLabelTreatDistinctAsVirtualColumn=Kohtele DISTINCT:iä virtuaalisena sarakkeena
StickyLabelNewLineAfterIn=Uusi rivi IN:n jälkeen
StickyLabelNewLineAfterExists=Uusi rivi EXISTS:n jälkeen
StickyLabelNewlineAfterComparisonOperator=Uusi rivi vertailu operaattorin jälkeen
StickyLabelNewlineBeforeComparisonOperator=Uusi rivi ennen vertailu operaattoria
StickyLabelIntoClauseInNewLine=INTO -lauseke uudella rivillä
ComboBoxFromClauseStyle=Tyyli
StickyLabelFromClauseInNewLine=FROM -lauseke uudella rivillä
StickyLabelJoinClauseInNewLine=JOIN -lauseke uudella rivillä
StickyLabelAlignJoinWithFromKeyword=Sisennä JOIN avainsanan FROM kanssa
StickyLabelAlignAndOrWithOnInJoinClause=Sisennä AND/OR ON:n kanssa JOIN lausekkeessa
StickyLabelAlignAliasInFromClause=Sisennä alias FROM -lausekeessa
ComboBoxAndOrLineBreak=Rivinvaihto
StickyLabelAndOrUnderWhere=AND/OR WHERE:n alla
StickyLabelWhereClauseInNewline=WHERE -lauseke uudella rivillä
StickyLabelWhereClauseAlignExpr=WHERE -lausekkeen sisennys lausekkeiden kanssa
ComboBoxGroupByClauseStyle=Tyyli
StickyLabelGroupByClauseInNewLine=GROUP BY -lauseke uudella rivillä
StickyLabelHavingClauseInNewLine=HAVING -lauseke uudella rivillä
ComboBoxOrderByClauseStyle=Tyyli
StickyLabelOrderByClauseInNewLine=ORDER BY -lauseke uudella rivillä

[OptionsSQLUpdateFrame]
ComboBoxColumnListStyle=Sarakelistan tyyli

[OptionsSQLWhitespaceFrame]
StickyLabelSpaceAroundOperator=Välilyönti aritmeettisen ilmaisun operaattorin ympärillä
StickyLabelSpaceInsideCreate=Välilyönti sulkujen sisällä CREATE FUNCTION/PROCEDURE:ssa
StickyLabelSpaceInsideExpression=Välilyönti sulkujen sisällä lausekkeissa
StickyLabelSpaceInsideSubquery=Välilyönti sulkujen sisällä alikyselyissä
StickyLabelSpaceInsideFunction=Välilyönti sulkujen sisällä funktion kutsuissa
StickyLabelSpaceInsideTypename=Välilyönti sulkujen sisällä tyyppinimessä CREATE TABLE:ssa

[OptionsStatusBarFrame]
StickyLabelUseSystemFont=Käytä järjestelmän kirjasinta
FontComboBoxFont=Kirjasin
EditFontSize=Kirjasimen koko
StickyLabelShowMacro=Näytä makro
StickyLabelShowCaretPosition=Näytä kursorin sijainti
StickyLabelShowKeyState=Näytä näppäintila
StickyLabelShowModified=Näytä muokattu

[OptionsToolbarFrame]
VirtualDrawTree:h=Vedä ja pudota siirtää valikon kohteita. Klikkaa oikealla popup-valikosta voit lisätä ja poistaa kohteita.
VirtualDrawTree:0=Valikon kohta
ActionAddItem=Lisää kohta
ActionAddItem:h=Lisää kohta
ActionDelete=Poista
ActionDelete:h=Poista
ActionAddDivider=Lisää jakaja
ActionAddDivider:h=Lisää jakaja
ActionReset=Palauta
ActionReset:h=Palauta alkuperäiset valikon kohdat
ActionMoveUp=Siirrä ylös
ActionMoveUp:h=Siirrä valittu kohta ylös
ActionMoveDown=Siirrä alas     
ActionMoveDown:h=Siirrä valittu kohta alas

[AboutDialog]
Caption=Tietoja ohjelmasta
LabelCopyright=Tekijänoikeudet %s. Kaikki oikeudet pidätetään.
LabelMemoryAvailable=Käytettävissä oleva muisti: %s
ButtonOK=OK
ButtonDonations=Lahjoitukset
LabelDevelopmentEnvironment=Kehitysympäristö
LabelThirdPartyComponents=Kolmansienosapuolien komponentit
LabelLanguageFileContributors=Kielitiedostojen avustajat
LabelIcons=Ikonit
LabelVersion=Versio %s (%d-bittinen)

[DirectoryTabDialog]
ButtonCancel=Peruuta
StickyLabelExcludeOtherBranches=Sulje pois muut hakemistopolut
ButtonOK=&OK
EditRootDirectory=Juurihakemisto
ComboBoxDrives=Asemat
ComboBoxFileMask=Tiedostosuodatin
EditTabName=Sivun nimi
GroupBoxOptions=Valinnat

[LanguageEditorForm]
ActionExit:h=Sulje kielieditori
ActionExit=Sulje
ActionFileNew:h=Luo uusi kielitiedosto
ActionFileNew=Uusi
ActionFileOpen:h=Avaa olemassa oleva kielitiedosto
ActionFileOpen=Avaa
ActionFileSave:h=Tallenna kielitiedosto
ActionFileSave=Tallenna
VirtualDrawTree:0=Kohde
VirtualDrawTree:1=Otsikko
VirtualDrawTree:2=Vihje
VirtualDrawTree:3=Pikanäppäin

[OptionsForm]
ActionCompare=Tiedostojen vertailu
ActionDirectory=Hakemisto
ActionDirectoryTabs=Sivut
ActionEditor=Editori
ActionEditorCaret=Kohdistin
ActionEditorCodeFolding=Koodin taitto
ActionEditorColors=Värit
ActionEditorCompletionProposal=Täydennysehdotus
ActionEditorDefaults=Oletusarvot
ActionEditorFonts=Kirjasin
ActionEditorLeftMargin=Vasen marginaali
ActionEditorMatchingPair=Yhteensopivat parit
ActionEditorMinimap=Minikartta
ActionEditorRightMargin=Oikea marginaali
ActionEditorScroll=Vieritys
ActionEditorSearch=Etsi
ActionEditorSelection=Valinta
ActionEditorSpecialChars=Erikoismerkit
ActionEditorSyncEdit=Synkronoitu muokkaus
ActionEditorTabs=Välilehdet
ActionEditorTabulator=Tabulaattori
ActionFileTypes=Tiedostotyypit
ActionMainMenu=Päävalikko
ActionOutput=Tuloste
ActionOutputTabs=Sivut
ActionPrint=Tulostus
ActionSQLAlignments=Ryhmittely
ActionSQLCapitalization=Isot kirjaimet
ActionSQLFormatter=SQL muotoilija
ActionSQLIndentation=Sisennys
ActionSQLInsert=Lisäys
ActionSQLSelect=Valinta
ActionSQLUpdate=Päivitys
ActionSQLWhitespace=Tyhjätila
ActionStatusBar=Tilarivi
ActionToolbar=Työkalurivi
ButtonCancel=Peruuta
ButtonOK=&OK
Caption=Asetukset
EditorTabsAction=Sivut

[UnicodeCharacterMapForm]
Caption=Unicode merkistö

[OptionsDirectoryFrame]
StickyLabelAutoHide=Piilota automaattisesti
StickyLabelShowTreeLines=Näytä puun viivat
StickyLabelShowHiddenFiles=Näytä piilotiedostot
StickyLabelShowSystemFiles=Näytä systeemitiedostot
StickyLabelShowArchiveFiles=Näytä arkistotiedostot
StickyLabelShowOverlayIcons=Näytä peittokuvakkeet
EditIndent=Sisennys
ComboBoxAlign=Sijainti

[OptionsDirectoryTabsFrame]
StickyLabelMultiline=Monirivinen
StickyLabelShowCloseButton=Näytä Sulje-painike
StickyLabelShowOpenDirectoryButton=Näytä Avaa hakemisto -painike 
StickyLabelShowImage=Näytä kuvake
StickyLabelCloseTabByDblClick=Sulje välilehti tuplaklikkauksella
StickyLabelCloseTabByMiddleClick=Sulje välilehti keskipainikkeella
StickyLabelDoubleBuffered=Tuplapuskuroitu
StickyLabelSaveTabs=Tallenna välilehdet
StickyLabelRightClickSelect=Oikean painikkeen valinta

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=Väri
ComboBoxDefaultEncoding=Koodaus
ComboBoxDefaultHighlighter=Koroste
ComboBoxDefaultSQLHighlighter=SQL koroste
EditBrowser=Selain

[OptionsEditorTabsFrame]
StickyLabelMultiline=Monirivinen
StickyLabelShowCloseButton=Näytä sulje-painike
StickyLabelShowImage=Näytä kuvake
StickyLabelCloseTabByDblClick=Sulje välilehti tuplaklikkauksella
StickyLabelCloseTabByMiddleClick=Sulje välilehti keskipainikkeella
StickyLabelDoubleBuffered=Tuplapuskuroitu
StickyLabelSaveTabs=Tallenna välilehdet
StickyLabelRightClickSelect=Oikean painikkeen valinta

[OptionsFileTypesFrame]
EditExtensions=Tunnisteet
VirtualDrawTree:0=Tiedostotyyppi

[OptionsOutputTabsFrame]
StickyLabelMultiline=Monirivinen
StickyLabelShowCloseButton=Näytä sulje-painike
StickyLabelShowImage=Näytä kuvake
StickyLabelCloseTabByDblClick=Sulje välilehti tuplaklikkauksella
StickyLabelCloseTabByMiddleClick=Sulje välilehti keskipainikkeella
StickyLabelDoubleBuffered=Tuplapuskuroitu
StickyLabelSaveTabs=Tallenna välilehdet
StickyLabelRightClickSelect=Oikean painikkeen valinta

[SQLFormatterConstant]
Stacked=Pinottu
Wrapped=Kääritty
AfterComma=Pilkun jälkeen
BeforeComma=Ennen pilkkua
BeforeCommaWithSpace=Ennen pilkkua välilyönnillä
NoLineBreak=Ei rivinvaihtoa
BeforeAndOr=Ennen AND/OR
AfterAndOr=Jälkeen AND/OR
Left=Vasen
Right=Oikea
None=Ei mitään
Uppercase=Isot kirjaimet
Lowercase=Pienet kirjaimet
SentenceCase=Iso alkukirjain
NoChange=Ei muutosta

[ConvertConstant]
Distance=Etäisyys
Micromicrons=Mikromikroni
Angstroms=Angstrom
Millimicrons=Millimikroni
Microns=Mikroni
Millimeters=Millimetri
Centimeters=Senttimetri
Decimeters=Desimetri
Meters=Metri
Decameters=Dekametri
Hectometers=Hehtometri
Kilometers=Kilometri
Megameters=Megametri
Gigameters=Gigametri
Inches=Tuuma
Feet=Jalka
Yards=Jaardi
Miles=Maili
NauticalMiles=Merimaili
AstronomicalUnits=Tähtitieteellinen yksikkö
LightYears=Valovuosi
Parsecs=Tähtiväli
Cubits=Kyynärä
Fathoms=Syli
Furlongs=Vako
Hands=Käsi
Paces=Askel
Rods=Tanko
Chains=Mittaketju
Links=Link
Picas=Pica
Points=Typograafinen piste
Area=Pinta-ala
SquareMillimeters=Neliömillimetri
SquareCentimeters=Neliösenttimetri
SquareDecimeters=Neliödesimetri
SquareMeters=Neliömetri
SquareDecameters=Neliödekametri
SquareHectometers=Neliöhehtometri
SquareKilometers=Neliökilometri
SquareInches=Neliötuuma
SquareFeet=Neliöjalka
SquareYards=Neliöjaardi
SquareMiles=Neliömaili
Acres=Eekkeri
Centares=Neliömetri
Ares=Aari
Hectares=Hehtaari
SquareRods=Neliötanko
Volume=Tilavuus
CubicMillimeters=Kuutiomillimetri
CubicCentimeters=Kuutiosenttimetri
CubicDecimeters=Kuutiodesimetri
CubicMeters=Kuutiometri
CubicDecameters=Kuutiodekametri
CubicHectometers=Kuutiohehtometri
CubicKilometers=Kuutiokilometri
CubicInches=Kuutiotuuma
CubicFeet=Kuutiojalka
CubicYards=Kuutiojaardi
CubicMiles=Kuutiomaili
MilliLiters=Millilitra
CentiLiters=Senttilitra
DeciLiters=Desilitra
Liters=Litra
DecaLiters=Dekalitra
HectoLiters=Hehtolitra
KiloLiters=Kilolitra
AcreFeet=Eekkerijalka
AcreInches=Eekkerituuma
Cords=Naru
CordFeet=Narujalka 
Decisteres=Decisteres
Steres=Steres
Decasteres=Decasteres
FluidGallons=Neste gallona
FluidPints=Neste pintti
FluidQuarts=Neste gallona
FluidCups=Neste kuppi
FluidGills=Neste gill
FluidOunces=Neste unssi
FluidTablespoons=Neste pöytälusikka
FluidTeaspoons=Neste teelusikka
DryGallons=Kuiva gallona
DryQuarts=Kuiva gallona
DryPints=Kuiva pintti
DryPecks=Kuiva Peck
DryBuckets=Kuiva ämpäri
DryBushels=Kuiva vakka
UKGallons=Gallona
UKPottle=UK pottle
UKQuarts=UK gallona
UKPints=Pintti
UKGill=UK gill
UKOunces=UK unssi
UKPecks=UK peck
UKBuckets=UK ämpäri
UKBushels=UK vakka
Mass=Paino
Nanograms=Nanogramma                                                 
Micrograms=Mikrogramma
Milligrams=Milligramma
Centigrams=Senttigramma
Decigrams=Desigramma
Grams=Gramma
Decagrams=Decagramma
Hectograms=Hehtogramma
Kilograms=Kilogramma
MetricTons=Metrinen tonni
Drams=Dram
Grains=Graani
LongTons=Pitkä tonni
Tons=Tonni
Ounces=Unssi
Pounds=Pauna
Stones=Kivi
NumeralSystem=Numeeriset järjestelmät
Binary=Binääri
Decimal=Desimaali
Hexadecimal=Heksadesimaali
Temperature=Lämpötila
Celsius=Celsius
Kelvin=Kelvin
Fahrenheit=Fahrenheit
Time=Aika
Reaumur=Reaumur
Rankine=Rankine
MilliSeconds=Millisekunti
Seconds=Sekunti
Minutes=Minuutti
Hours=Tunti
Days=Päivä
Weeks=Viikko
Fortnights=Kaksi viikkoa
Months=Kuukausi
Years=Vuosi
Decades=Vuosikymmen
Centuries=Vuosisata
Millennia=Vuosituhat
DateTime=Päiväys aika
JulianDate=Juliaaninen päiväys
ModifiedJulianDate=Muokattu Juliaaninen päiväys